#### Agrupamento e Resumo de Dados
***

O agrupamento e resumo de dados são etapas essenciais na análise de dados, permitindo extrair informações úteis e insights valiosos a partir de conjuntos de dados complexos. Essas técnicas nos permitem organizar, resumir e comparar os dados com base em categorias ou critérios específicos.

#### Importação das Bibliotecas

In [1]:
import pandas as pd

#### Coletando Dados de Perfil
***

In [4]:
df = pd.read_csv('../../source_data/perfil_clientes.csv', sep=';')

#### Método groupby
***
Uma das principais ferramentas utilizadas para agrupar e resumir dados no pandas, uma biblioteca popular do Python para análise de dados, é o método groupby. Esse método permite agrupar os dados com base em uma ou mais colunas, criando grupos que compartilham características comuns. Em seguida, podemos aplicar funções de agregação aos grupos para resumir os dados, como contar, somar, calcular média, máximo, mínimo, entre outros.

In [5]:
df.head()

,idade,classe_trabalho,escolaridade,anos_estudo,estado_civil,raca,sexo,UF,região,qtde_filhos,salario
0,39,Servidor Público,Ensino Médio Completo,13,Solteiro,Branco,Masculino,RO,Norte,2.0,4754
1,50,Autônomo,Superior Incompleto,13,Casado,Branco,Masculino,AC,Norte,1.0,3923
2,38,Funcionário Setor Privado,Ensino Médio Incompleto,9,Divorciado,Branco,Masculino,AM,Norte,0.0,1100
3,53,Funcionário Setor Privado,Ensino Médio Incompleto,7,Casado,Negro,Masculino,RR,Norte,1.0,1100
4,28,Funcionário Setor Privado,Ensino Médio Completo,13,Casado,Negro,Feminino,PA,Norte,0.0,3430

In [6]:
df_agrupado = df.groupby('classe_trabalho')['salario'].sum()
df_agrupado

classe_trabalho
Aposentado                    1033500
Autônomo                      1581160
Desempregado                        0
Empresário                    5054548
Estagiário                       1100
Funcionário Público            903206
Funcionário Setor Privado    13266341
MEI                           1084767
Menor Aprendiz                  97600
Servidor Público              1525387
Name: salario, dtype: int64

In [ ]:
agrupamento = ['classe_trabalho', 'estado_civil', 'sexo']

df.groupby(agrupamento)['salario'].mean().round(2)

classe_trabalho   estado_civil   sexo
Aposentado        Casado         Feminino     3287.14
                                 Masculino    3966.74
                  Divorciado     Feminino     4233.67
                                 Masculino    3941.40
                  Separado       Feminino     2971.00
                                               ...
Servidor Público  Solteiro       Masculino    5154.23
                  União Estável  Feminino     5387.00
                                 Masculino    4793.33
                  Viúvo          Feminino     3025.67
                                 Masculino    8107.00
Name: salario, Length: 89, dtype: float64

In [10]:

df.groupby(agrupamento)['salario'].mean().round(2).reset_index()

     classe_trabalho   estado_civil       sexo  salario
0         Aposentado         Casado   Feminino  3287.14
1         Aposentado         Casado  Masculino  3966.74
2         Aposentado     Divorciado   Feminino  4233.67
3         Aposentado     Divorciado  Masculino  3941.40
4         Aposentado       Separado   Feminino  2971.00
..               ...            ...        ...      ...
84  Servidor Público       Solteiro  Masculino  5154.23
85  Servidor Público  União Estável   Feminino  5387.00
86  Servidor Público  União Estável  Masculino  4793.33
87  Servidor Público          Viúvo   Feminino  3025.67
88  Servidor Público          Viúvo  Masculino  8107.00

[89 rows x 4 columns]

#### Método agg
***
Esse método permite aplicar várias funções de agregação aos grupos definidos pelo groupby. Podemos calcular diferentes métricas para cada grupo ou até mesmo aplicar funções personalizadas.

In [ ]:
# Agrupar os dados por categoria e calcular a soma das vendas em cada categoria

#### Método pivot_table
***
Permite criar uma tabela dinâmica a partir dos dados, onde as linhas representam uma categoria, as colunas representam outra categoria e os valores são agregados com base em uma terceira categoria.

#### Método info
***
Fornece um resumo conciso das informações básicas sobre um DataFrame, incluindo o número de linhas, o número de colunas, os nomes das colunas e os tipos de dados de cada coluna. Além disso, ele também mostra a quantidade de memória usada pelo DataFrame. Isso é particularmente útil quando estamos lidando com conjuntos de dados grandes e queremos ter uma visão geral rápida de sua estrutura.

#### Método describe

***
Fornece um resumo estatístico das colunas numéricas de um DataFrame. Ele calcula várias estatísticas descritivas, como contagem, média, desvio padrão, valor mínimo, quartis e valor máximo. Essa função nos ajuda a ter uma visão rápida das principais informações estatísticas de cada coluna numérica, permitindo identificar tendências, distribuições e possíveis outliers nos dados.

### Método Transpose

***
A função transpose pode ser útil em diversas situações, como quando queremos realizar operações em colunas específicas, quando precisamos ajustar a estrutura do DataFrame para uma determinada análise ou quando desejamos apresentar os dados de uma forma mais adequada para visualização.

A função transpose do Pandas nos permite realizar a transposição de um DataFrame, trocando as linhas pelas colunas e as colunas pelas linhas. Essa função é útil quando queremos modificar a orientação dos dados para melhor adequá-los às nossas necessidades de análise e visualização.